# NorthSouth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProjectPosition..::..NorthSouth Property
ProjectPosition Class See Also
---
North/South offset
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double NorthSouth { get; set; }
```

Visual Basic
---
```text
Public Property NorthSouth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double NorthSouth {
	double get ();
	void set (double value);
}
```

# Remarks
The offset of the project location from the site location in the north/south direction. Measured in decimal feet.
# See Also
ProjectPosition Class
Autodesk.Revit.DB Namespace